&Uuml;ber diese Funktion kann ein automatischer Update des NavEditors durchgef&uuml;hrt werden.

Bitte beachten Sie den Unterschied der Versionen:

<b>Test-Versionen</b> sind solche Versionen, die vom Webteam unter dem Vorbehalt ausgegeben werden, da&szlig; diese noch nicht richtig arbeiten und es im Betrieb zu Fehler kommen kann. Es handelt sich dabei
allerdings um die Versionen mit den neuesten Funktionen und aktuellsten Fehlerkorrekturen.

Unter einer <b>stabilen Version</b> verstehen wir eine Version, von der das WebTeam der Meinung ist, da&szlig; sie f&uuml;r die t&auml;gliche Nutzung geeignet ist.

Sollten Fehler auftreten, bitten wir um Benachrichtung an die Adresse
    <a href="mailto:webmaster@rrze.uni-erlangen.de">webmaster@rrze.uni-erlangen.de</a>
zusammen mit einer Beschreibung wie sich dieser Fehler &auml;u&szlig;erte und welche Handlungen getan wurden, damit der Fehler auftrat.


Bitte beachten Sie, da&szlig; der NavEditor vom WebTeam als unverbindliches Hilfsmittel bereitgestellt wird. Dies in der Hoffnung, da&szlig; damit auch ungeschulte oder unerfahrene Benutzer in die Lage versetzt werden, schnell und einfach Inhalte von Webauftritten zu &auml;ndern. 
F&uuml;r Wbemaster, die es gewohnt sind, direkt im HTML zu arbeiten empfehlen wir statt dem NavEditor die Nutzung von professionellen Produkten, wie beispielsweise Dreamweaver oder Bluefish.

Der Editor reicht in seiner Funktionalit&auml;t  nat&uuml;rlich nicht an kommerzielle Produkte oder komplexe Redaktionssysteme heran, noch ersetzt es diese. 
Sollte der Editor nicht f&uuml;r den Einsatz auf einem Webauftritt ausreichen, ber&auml;t das Webteam gerne &uuml;ber individuell auf den jeweiligen Einsatz abgestimmte Alternativen.

Grunds&auml;tzlich gilt f&uuml;r alle Versionen, egal ob Test- oder stabiler Version der Vorbehalt, da&szlig; keine Gew&auml;hrleistung oder Garantie f&uuml;r  den fehlerfreien Betrieb  &uuml;bernommen werden kann.  Das Webteam des RRZE bem&uuml;ht sich, eine fehlerfreie Version bereit zu stellen. Da das RRZE Webteam jedoch keinen kostenfreien Full-Service-Support anbieten kann, ist es nicht m&ouml;glich, eine Betriebsgarantie zu geben. 
Die Nutzung des NavEditors erfolgt daher grunds&auml;tzlich auf eigenen Risiko.